org/2024-01-01-Python_Selenium_Crawling_Quickstart.org
* Python Selenium Crawling Quickstart
- create webdriver
#+begin_src python
  from selenium import webdriver
  driver = webdriver.Firefox()
  driver.implicitly_wait(5)
#+end_src

- get page and element inside page
#+begin_src python
  from selenium.webdriver.common.by import By

  # ========= By module ==========
  # ID = "id"
  # NAME = "name"
  # XPATH = "xpath"
  # LINK_TEXT = "link text"
  # PARTIAL_LINK_TEXT = "partial link text"
  # TAG_NAME = "tag name"
  # CLASS_NAME = "class name"
  # CSS_SELECTOR = "css selector"
  element = driver.find_element(by=By.ID, value="constituents")
#+end_src

- select inner element by XPATH
#+begin_src python
  xpath = ".//div[4]/div[1]/div[last()-1]"
  inner_element = element.find_elements(By.XPATH, xpath)
  inner_element.text
#+end_src

